{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"keras_tensor": {"name": "keras_tensor:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "60"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "400"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "400"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "60"}, {"size": "60"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/add", "op": "_FusedConv2D", "input": ["keras_tensor", "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/Reshape"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "filter_format": {"s": "SFdJTw=="}, "num_args": {"i": "1"}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/add"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1_2/Reshape"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/add"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu", "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_2_1/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_2_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/add"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_2_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/conv2d_2_1/Relu", "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "shape": [3, 3, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Reshape", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Reshape", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_2_1/Reshape", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [400, 400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Add/ReadVariableOp", "shape": [400], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [400, 4], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Add/ReadVariableOp", "shape": [4], "dtype": "float32"}]}]}